In [1]:
import numpy as np
import pandas as pd

In [3]:
pd.read_excel('StudentDB.xlsx')

   Roll Name  Marks Address
0     1  ABC     67    Pune
1     2  XYZ     45  Mumbai
2     3  PQR     55    Pune
3     4  MNO     87  Mumbai
4     5  ASD     81    Pune
5     6  JKL     72  Mumbai